###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/ec2-user/environment/actions-runner/_work/_temp/8a8e1c05-56ed-4351-880f-a15e13dca5d0/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc-prod.aws_internet_gateway.igw[0] has been deleted
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:us-east-1:775273113262:internet-gateway/igw-0c6a2f576a4bdcf49" -> null
      - id       = "igw-0c6a2f576a4bdcf49" -> null
      - owner_id = "775273113262" -> null
      - tags     = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-igw"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-igw"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id   = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_route_table.private_subnets has been deleted
  - resource "aws_route_table" "private_subnets" {
      - arn              = "arn:aws:ec2:us-east-1:775273113262:route-table/rtb-0c8dad95d7cbfb3b9" -> null
      - id               = "rtb-0c8dad95d7cbfb3b9" -> null
      - owner_id         = "775273113262" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "Group5-prod-route-private-subnets"
        } -> null
      - tags_all         = {
          - "Name" = "Group5-prod-route-private-subnets"
        } -> null
      - vpc_id           = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_route_table.public_subnets[0] has been deleted
  - resource "aws_route_table" "public_subnets" {
      - arn              = "arn:aws:ec2:us-east-1:775273113262:route-table/rtb-01115eb2584ec5836" -> null
      - id               = "rtb-01115eb2584ec5836" -> null
      - owner_id         = "775273113262" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0c6a2f576a4bdcf49"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "Group5-prod-route-public-subnets"
        } -> null
      - tags_all         = {
          - "Name" = "Group5-prod-route-public-subnets"
        } -> null
      - vpc_id           = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_route_table_association.private_route_table_association[0] has been deleted
  - resource "aws_route_table_association" "private_route_table_association" {
      - id             = "rtbassoc-0726bd2380b0c230e" -> null
      - route_table_id = "rtb-0c8dad95d7cbfb3b9" -> null
      - subnet_id      = "subnet-01bc04d2b70b7427e" -> null
    }

  # module.vpc-prod.aws_route_table_association.private_route_table_association[1] has been deleted
  - resource "aws_route_table_association" "private_route_table_association" {
      - id             = "rtbassoc-0de47549805303847" -> null
      - route_table_id = "rtb-0c8dad95d7cbfb3b9" -> null
      - subnet_id      = "subnet-0d2ba1669133b64bb" -> null
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[0] has been deleted
  - resource "aws_route_table_association" "public_route_table_association" {
      - id             = "rtbassoc-02198e62e8a9ce8d4" -> null
      - route_table_id = "rtb-01115eb2584ec5836" -> null
      - subnet_id      = "subnet-0ff5fa7d388fc75c8" -> null
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[1] has been deleted
  - resource "aws_route_table_association" "public_route_table_association" {
      - id             = "rtbassoc-0fcb87eb834a1cf9f" -> null
      - route_table_id = "rtb-01115eb2584ec5836" -> null
      - subnet_id      = "subnet-0b934c96b007b7c81" -> null
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[2] has been deleted
  - resource "aws_route_table_association" "public_route_table_association" {
      - id             = "rtbassoc-0e1569838597287a6" -> null
      - route_table_id = "rtb-01115eb2584ec5836" -> null
      - subnet_id      = "subnet-0087d5fb555f69b04" -> null
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[3] has been deleted
  - resource "aws_route_table_association" "public_route_table_association" {
      - id             = "rtbassoc-0d3bb30ad2e5cf23d" -> null
      - route_table_id = "rtb-01115eb2584ec5836" -> null
      - subnet_id      = "subnet-045fccedde7879668" -> null
    }

  # module.vpc-prod.aws_subnet.private_subnet[0] has been deleted
  - resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-01bc04d2b70b7427e" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.1.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01bc04d2b70b7427e" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "775273113262" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-private-subnet-0"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                                       = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-private-subnet-0"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_subnet.private_subnet[1] has been deleted
  - resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0d2ba1669133b64bb" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.1.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d2ba1669133b64bb" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "775273113262" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-private-subnet-1"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                                       = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-private-subnet-1"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_subnet.public_subnet[0] has been deleted
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0ff5fa7d388fc75c8" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.1.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0ff5fa7d388fc75c8" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "775273113262" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-0"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                                       = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-0"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_subnet.public_subnet[1] has been deleted
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0b934c96b007b7c81" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.1.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b934c96b007b7c81" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "775273113262" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-1"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                                       = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-1"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_subnet.public_subnet[2] has been deleted
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0087d5fb555f69b04" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.1.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0087d5fb555f69b04" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "775273113262" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-2"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                                       = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-2"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_subnet.public_subnet[3] has been deleted
  - resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-045fccedde7879668" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.1.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-045fccedde7879668" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "775273113262" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-3"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                                       = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-public-subnet-3"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null
    }

  # module.vpc-prod.aws_vpc.main has been deleted
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:vpc/vpc-0cebd7b15fd973636" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.1.0.0/16" -> null
      - default_network_acl_id               = "acl-097cf441d24975d96" -> null
      - default_route_table_id               = "rtb-0d500f1d006277507" -> null
      - default_security_group_id            = "sg-04d2300bc7036fa47" -> null
      - dhcp_options_id                      = "dopt-0231a293739b3e772" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0cebd7b15fd973636" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0d500f1d006277507" -> null
      - owner_id                             = "775273113262" -> null
      - tags                                 = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-VPC-acs730"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
      - tags_all                             = {
          - "App"   = "Web"
          - "Name"  = "Group5-prod-VPC-acs730"
          - "Owner" = "CAAacs"
          - "env"   = "prod"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc-prod.aws_internet_gateway.igw[0] will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-igw"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-igw"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc-prod.aws_route_table.private_subnets will be created
  + resource "aws_route_table" "private_subnets" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Group5-prod-route-private-subnets"
        }
      + tags_all         = {
          + "Name" = "Group5-prod-route-private-subnets"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.public_subnets[0] will be created
  + resource "aws_route_table" "public_subnets" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Group5-prod-route-public-subnets"
        }
      + tags_all         = {
          + "Name" = "Group5-prod-route-public-subnets"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private_route_table_association[0] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private_route_table_association[1] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[0] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[1] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[2] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public_route_table_association[3] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-private-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-private-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-private-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-private-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-2"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-2"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public_subnet[3] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-3"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-public-subnet-3"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-VPC-acs730"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "Group5-prod-VPC-acs730"
          + "Owner" = "CAAacs"
          + "env"   = "prod"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ private_subnet_ids = [
      - "subnet-01bc04d2b70b7427e",
      - "subnet-0d2ba1669133b64bb",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_route_table = [
      - "rtb-01115eb2584ec5836",
      + (known after apply),
    ]
  ~ public_subnet_ids  = [
      - "subnet-0ff5fa7d388fc75c8",
      - "subnet-0b934c96b007b7c81",
      - "subnet-0087d5fb555f69b04",
      - "subnet-045fccedde7879668",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ vpc_id             = "vpc-0cebd7b15fd973636" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # module.vpc-prod.aws_internet_gateway.igw[0] has been deleted%0A  - resource "aws_internet_gateway" "igw" {%0A      - arn      = "arn:aws:ec2:us-east-1:775273113262:internet-gateway/igw-0c6a2f576a4bdcf49" -> null%0A      - id       = "igw-0c6a2f576a4bdcf49" -> null%0A      - owner_id = "775273113262" -> null%0A      - tags     = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-igw"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-igw"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id   = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table.private_subnets has been deleted%0A  - resource "aws_route_table" "private_subnets" {%0A      - arn              = "arn:aws:ec2:us-east-1:775273113262:route-table/rtb-0c8dad95d7cbfb3b9" -> null%0A      - id               = "rtb-0c8dad95d7cbfb3b9" -> null%0A      - owner_id         = "775273113262" -> null%0A      - propagating_vgws = [] -> null%0A      - route            = [] -> null%0A      - tags             = {%0A          - "Name" = "Group5-prod-route-private-subnets"%0A        } -> null%0A      - tags_all         = {%0A          - "Name" = "Group5-prod-route-private-subnets"%0A        } -> null%0A      - vpc_id           = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table.public_subnets[0] has been deleted%0A  - resource "aws_route_table" "public_subnets" {%0A      - arn              = "arn:aws:ec2:us-east-1:775273113262:route-table/rtb-01115eb2584ec5836" -> null%0A      - id               = "rtb-01115eb2584ec5836" -> null%0A      - owner_id         = "775273113262" -> null%0A      - propagating_vgws = [] -> null%0A      - route            = [%0A          - {%0A              - carrier_gateway_id         = ""%0A              - cidr_block                 = "0.0.0.0/0"%0A              - core_network_arn           = ""%0A              - destination_prefix_list_id = ""%0A              - egress_only_gateway_id     = ""%0A              - gateway_id                 = "igw-0c6a2f576a4bdcf49"%0A              - ipv6_cidr_block            = ""%0A              - local_gateway_id           = ""%0A              - nat_gateway_id             = ""%0A              - network_interface_id       = ""%0A              - transit_gateway_id         = ""%0A              - vpc_endpoint_id            = ""%0A              - vpc_peering_connection_id  = ""%0A            },%0A        ] -> null%0A      - tags             = {%0A          - "Name" = "Group5-prod-route-public-subnets"%0A        } -> null%0A      - tags_all         = {%0A          - "Name" = "Group5-prod-route-public-subnets"%0A        } -> null%0A      - vpc_id           = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private_route_table_association[0] has been deleted%0A  - resource "aws_route_table_association" "private_route_table_association" {%0A      - id             = "rtbassoc-0726bd2380b0c230e" -> null%0A      - route_table_id = "rtb-0c8dad95d7cbfb3b9" -> null%0A      - subnet_id      = "subnet-01bc04d2b70b7427e" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private_route_table_association[1] has been deleted%0A  - resource "aws_route_table_association" "private_route_table_association" {%0A      - id             = "rtbassoc-0de47549805303847" -> null%0A      - route_table_id = "rtb-0c8dad95d7cbfb3b9" -> null%0A      - subnet_id      = "subnet-0d2ba1669133b64bb" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[0] has been deleted%0A  - resource "aws_route_table_association" "public_route_table_association" {%0A      - id             = "rtbassoc-02198e62e8a9ce8d4" -> null%0A      - route_table_id = "rtb-01115eb2584ec5836" -> null%0A      - subnet_id      = "subnet-0ff5fa7d388fc75c8" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[1] has been deleted%0A  - resource "aws_route_table_association" "public_route_table_association" {%0A      - id             = "rtbassoc-0fcb87eb834a1cf9f" -> null%0A      - route_table_id = "rtb-01115eb2584ec5836" -> null%0A      - subnet_id      = "subnet-0b934c96b007b7c81" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[2] has been deleted%0A  - resource "aws_route_table_association" "public_route_table_association" {%0A      - id             = "rtbassoc-0e1569838597287a6" -> null%0A      - route_table_id = "rtb-01115eb2584ec5836" -> null%0A      - subnet_id      = "subnet-0087d5fb555f69b04" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[3] has been deleted%0A  - resource "aws_route_table_association" "public_route_table_association" {%0A      - id             = "rtbassoc-0d3bb30ad2e5cf23d" -> null%0A      - route_table_id = "rtb-01115eb2584ec5836" -> null%0A      - subnet_id      = "subnet-045fccedde7879668" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private_subnet[0] has been deleted%0A  - resource "aws_subnet" "private_subnet" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-01bc04d2b70b7427e" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1a" -> null%0A      - availability_zone_id                           = "use1-az6" -> null%0A      - cidr_block                                     = "10.1.5.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-01bc04d2b70b7427e" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "775273113262" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-private-subnet-0"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                                       = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-private-subnet-0"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private_subnet[1] has been deleted%0A  - resource "aws_subnet" "private_subnet" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0d2ba1669133b64bb" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1b" -> null%0A      - availability_zone_id                           = "use1-az1" -> null%0A      - cidr_block                                     = "10.1.6.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0d2ba1669133b64bb" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "775273113262" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-private-subnet-1"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                                       = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-private-subnet-1"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[0] has been deleted%0A  - resource "aws_subnet" "public_subnet" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0ff5fa7d388fc75c8" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1a" -> null%0A      - availability_zone_id                           = "use1-az6" -> null%0A      - cidr_block                                     = "10.1.1.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0ff5fa7d388fc75c8" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "775273113262" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-0"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                                       = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-0"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[1] has been deleted%0A  - resource "aws_subnet" "public_subnet" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0b934c96b007b7c81" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1b" -> null%0A      - availability_zone_id                           = "use1-az1" -> null%0A      - cidr_block                                     = "10.1.2.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0b934c96b007b7c81" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "775273113262" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-1"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                                       = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-1"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[2] has been deleted%0A  - resource "aws_subnet" "public_subnet" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-0087d5fb555f69b04" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1c" -> null%0A      - availability_zone_id                           = "use1-az2" -> null%0A      - cidr_block                                     = "10.1.3.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0087d5fb555f69b04" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "775273113262" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-2"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                                       = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-2"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[3] has been deleted%0A  - resource "aws_subnet" "public_subnet" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:775273113262:subnet/subnet-045fccedde7879668" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1d" -> null%0A      - availability_zone_id                           = "use1-az4" -> null%0A      - cidr_block                                     = "10.1.4.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-045fccedde7879668" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "775273113262" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-3"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                                       = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-public-subnet-3"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                                         = "vpc-0cebd7b15fd973636" -> null%0A    }%0A%0A  # module.vpc-prod.aws_vpc.main has been deleted%0A  - resource "aws_vpc" "main" {%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:vpc/vpc-0cebd7b15fd973636" -> null%0A      - assign_generated_ipv6_cidr_block     = false -> null%0A      - cidr_block                           = "10.1.0.0/16" -> null%0A      - default_network_acl_id               = "acl-097cf441d24975d96" -> null%0A      - default_route_table_id               = "rtb-0d500f1d006277507" -> null%0A      - default_security_group_id            = "sg-04d2300bc7036fa47" -> null%0A      - dhcp_options_id                      = "dopt-0231a293739b3e772" -> null%0A      - enable_dns_hostnames                 = false -> null%0A      - enable_dns_support                   = true -> null%0A      - enable_network_address_usage_metrics = false -> null%0A      - id                                   = "vpc-0cebd7b15fd973636" -> null%0A      - instance_tenancy                     = "default" -> null%0A      - ipv6_netmask_length                  = 0 -> null%0A      - main_route_table_id                  = "rtb-0d500f1d006277507" -> null%0A      - owner_id                             = "775273113262" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-VPC-acs730"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group5-prod-VPC-acs730"%0A          - "Owner" = "CAAacs"%0A          - "env"   = "prod"%0A        } -> null%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc-prod.aws_internet_gateway.igw[0] will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-igw"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + tags_all = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-igw"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table.private_subnets will be created%0A  + resource "aws_route_table" "private_subnets" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "Group5-prod-route-private-subnets"%0A        }%0A      + tags_all         = {%0A          + "Name" = "Group5-prod-route-private-subnets"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table.public_subnets[0] will be created%0A  + resource "aws_route_table" "public_subnets" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Group5-prod-route-public-subnets"%0A        }%0A      + tags_all         = {%0A          + "Name" = "Group5-prod-route-public-subnets"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private_route_table_association[0] will be created%0A  + resource "aws_route_table_association" "private_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private_route_table_association[1] will be created%0A  + resource "aws_route_table_association" "private_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[0] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[1] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[2] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public_route_table_association[3] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private_subnet[0] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-private-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-private-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private_subnet[1] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-private-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-private-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[0] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-public-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-public-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[1] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-public-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group5-prod-public-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public_subnet[2] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                 
  ```
  </details>
  *Pusher: @Gaurav-17, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*